Revit 2027 API
CableTrayConduitBase.RunId Property
 The id of the run to which this element belongs.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId RunId { get; }
Public ReadOnly Property RunId As ElementId
	Get
public:
property ElementId^ RunId {
	ElementId^ get ();
}
member RunId : ElementId with get
Property Value
ElementId
See Also
Reference
CableTrayConduitBase Class
Autodesk.Revit.DB.Electrical Namespace